In [4]:
import pandas as pd
l = [x for x in range(5)]
s = pd.Series(l)
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [7]:
s = pd.Series(l,index=['a', 'b', 'c', 'd', 'e'])
print(s)
s['e']

a    0
b    1
c    2
d    3
e    4
dtype: int64

4

In [10]:
s = pd.Series(l,index=['a', 'b', 'c', 'd', 'd']) #will return both val with 'd'
print(s)
s['d']

a    0
b    1
c    2
d    3
d    4
dtype: int64

d    3
d    4
dtype: int64

In [16]:
#can do same with dictionary
data = {'a':1,'b':2,'c':3,'d':4}
s = pd.Series(data)
print(s)
s = pd.Series(data, index=['a','b'])
s

a    1
b    2
c    3
d    4
dtype: int64

a    1
b    2
dtype: int64

In [18]:
s = pd.Series(data, index=['a','b','c','f']) #value of f not present
s

a    1.0
b    2.0
c    3.0
f    NaN
dtype: float64

In [20]:
#Create a Series
s = pd.Series([x for x in range(1,11)])
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [24]:
print(s.iloc[1])
print(s.iat[2])
print(s.where(s%2==0))
print(s.where(s%2==0, 'odd number'))

2
3
0     NaN
1     2.0
2     NaN
3     4.0
4     NaN
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64
0    odd number
1             2
2    odd number
3             4
4    odd number
5             6
6    odd number
7             8
8    odd number
9            10
dtype: object

In [26]:
s.where(s%2==0, s**2) #squares all odd vals

0     1
1     2
2     9
3     4
4    25
5     6
6    49
7     8
8    81
9    10
dtype: int64

In [33]:
print(s.where(s%2==0, inplace=True))
print(s)
s.dropna() #removes all NaN values

None
0     NaN
1     2.0
2     NaN
3     4.0
4     NaN
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64

1     2.0
3     4.0
5     6.0
7     8.0
9    10.0
dtype: float64

In [35]:

s.fillna('blockhead') #fill every null value wth specified txt

0    blockhead
1          2.0
2    blockhead
3          4.0
4    blockhead
5          6.0
6    blockhead
7          8.0
8    blockhead
9         10.0
dtype: object

In [43]:
df = pd.DataFrame()
df = pd.read_csv('movies-db.csv')
df.tail() #last 5 rows 
df.head() #first 5 rows
df. head(2) #first 2 rws

,name,year,length_min,genre,average_rating,cost_millions,foreign,age_restriction
0,Toy Story,1995,81,Animation,8.3,30.0,0,0
1,Akira,1998,125,Animation,8.1,10.4,1,14

In [45]:
df.iloc[0] #gives info of first row

name               Toy Story
year                    1995
length_min                81
genre              Animation
average_rating           8.3
cost_millions           30.0
foreign                    0
age_restriction            0
Name: 0, dtype: object

In [52]:
 #if file too big can div in smaller parts
df = pd.read_csv('movies-db.csv', chunksize=2) 
for chunk in df:
    print(chunk)

        name  year  length_min      genre  average_rating  cost_millions  \
0  Toy Story  1995          81  Animation             8.3           30.0
1      Akira  1998         125  Animation             8.1           10.4

   foreign  age_restriction
0        0                0
1        1               14
                 name  year  length_min    genre  average_rating  \
2  The Breakfast Club  1985          97    Drama             7.9
3          The Artist  2011         100  Romance             8.0

   cost_millions  foreign  age_restriction
2              1        0               14
3             15        1               12
           name  year  length_min   genre  average_rating  cost_millions  \
4  Modern Times  1936          87  Comedy             8.6            1.5
5    Fight Club  1999         139   Drama             8.9           63.0

   foreign  age_restriction
4        0               10
5        0               18
               name  year  length_min  genre  average_rating  cost_millions  \
6       City of God  2002         130  Crime             8.7            3.3
7  The Untouchables  1987         119  Drama             7.9           25.0

   foreign  age_restriction
6        1               18
7        0               14
                   name  year  length_min   genre  average_rating  \
8  Star Wars Episode IV  1977         121  Action             8.7
9       American Beauty  1999         122   Drama             8.4

   cost_millions  foreign  age_restriction
8             11        0               10
9             15        0               14
               name  year  length_min   genre  average_rating  cost_millions  \
10             Room  2015         118   Drama             8.3           13.0
11  Dr. Strangelove  1964          94  Comedy             8.5            1.8

    foreign  age_restriction
10        1               14
11        1               10
                               name  year  length_min   genre  average_rating  \
12                         The Ring  1998          95  Horror             7.3
13  Monty Python and the Holy Grail  1975          91  Comedy             8.3

    cost_millions  foreign  age_restriction
12            1.2        1               18
13            0.4        1               18
                   name  year  length_min   genre  average_rating  \
14  High School Musical  2006          98  Comedy             5.2
15    Shaun of the Dead  2004          99  Horror             8.0

    cost_millions  foreign  age_restriction
14            4.2        0                0
15            6.1        1               18
                        name  year  length_min  genre  average_rating  \
16               Taxi Driver  1976         113  Crime             8.3
17  The Shawshank Redemption  1994         142  Crime             9.3

    cost_millions  foreign  age_restriction
16            1.3        1               14
17           25.0        0               16
            name  year  length_min      genre  average_rating  cost_millions  \
18  Interstellar  2014         169  Adventure             8.6            165
19        Casino  1995         178  Biography             8.2             50

    foreign  age_restriction
18        0               10
19        0               18
                          name  year  length_min      genre  average_rating  \
20              The Goodfellas  1990         145  Biography             8.7
21  Blue is the Warmest Colour  2013         179    Romance             7.8

    cost_millions  foreign  age_restriction
20           25.0        0               14
21            4.5        1               18
                  name  year  length_min     genre  average_rating  \
22          Black Swan  2010         108  Thriller             8.0
23  Back to the Future  1985         116    Sci-fi             8.5

    cost_millions  foreign  age_restriction
22             13        0               16
23             19        0                0
        name  year  length_min     genre  average_rating  cost_millions  \
24  The Wave  2008         107  Thriller             7.6            5.5
25  Whiplash  2014         106     Drama             8.5            3.3

    foreign  age_restriction
24        1               16
25        1               12
                        name  year  length_min    genre  average_rating  \
26  The Grand Hotel Budapest  2014         100    Crime             8.1
27                   Jumanji  1995         104  Fantasy             6.9

    cost_millions  foreign  age_restriction
26           25.5        0               14
27           65.0        0               12
                                         name  year  length_min   genre  \
28  The Eternal Sunshine of the Spotless Mind  2004         108   Drama
29                                    Chicago  2002         113  Comedy

    average_rating  cost_millions  foreign  age_restriction
28             8.3             20        0               14
29             7.2             45        0               12

In [55]:
df = pd.read_csv('movies-db.csv')
df = df[df['length_min']>119] #only movies wth length > 25
df

,name,year,length_min,genre,average_rating,cost_millions,foreign,age_restriction
1,Akira,1998,125,Animation,8.1,10.4,1,14
5,Fight Club,1999,139,Drama,8.9,63.0,0,18
6,City of God,2002,130,Crime,8.7,3.3,1,18
8,Star Wars Episode IV,1977,121,Action,8.7,11.0,0,10
9,American Beauty,1999,122,Drama,8.4,15.0,0,14
17,The Shawshank Redemption,1994,142,Crime,9.3,25.0,0,16
18,Interstellar,2014,169,Adventure,8.6,165.0,0,10
19,Casino,1995,178,Biography,8.2,50.0,0,18
20,The Goodfellas,1990,145,Biography,8.7,25.0,0,14
21,Blue is the Warmest Colour,2013,179,Romance,7.8,4.5,1,18

In [96]:
df = pd.read_csv('movies-db.csv', parse_dates=True)
dfh = df.head()

In [97]:
dfh.set_index(['name', 'genre'], inplace=True)
dfh.index

MultiIndex([(         'Toy Story', 'Animation'),
            (             'Akira', 'Animation'),
            ('The Breakfast Club',     'Drama'),
            (        'The Artist',   'Romance'),
            (      'Modern Times',    'Comedy')],
           names=['name', 'genre'])

In [101]:
df = pd.read_csv('movies-db.csv', parse_dates=True)
df.set_index(['name', 'year'], inplace=True)
df.index

MultiIndex([(                                'Toy Story', 1995),
            (                                    'Akira', 1998),
            (                       'The Breakfast Club', 1985),
            (                               'The Artist', 2011),
            (                             'Modern Times', 1936),
            (                               'Fight Club', 1999),
            (                              'City of God', 2002),
            (                         'The Untouchables', 1987),
            (                     'Star Wars Episode IV', 1977),
            (                          'American Beauty', 1999),
            (                                     'Room', 2015),
            (                          'Dr. Strangelove', 1964),
            (                                 'The Ring', 1998),
            (          'Monty Python and the Holy Grail', 1975),
            (                      'High School Musical', 2006),
            (                        'Shaun of the Dead', 2004),
            (                              'Taxi Driver', 1976),
            (                 'The Shawshank Redemption', 1994),
            (                             'Interstellar', 2014),
            (                                   'Casino', 1995),
            (                           'The Goodfellas', 1990),
            (               'Blue is the Warmest Colour', 2013),
            (                               'Black Swan', 2010),
            (                       'Back to the Future', 1985),
            (                                 'The Wave', 2008),
            (                                 'Whiplash', 2014),
            (                 'The Grand Hotel Budapest', 2014),
            (                                  'Jumanji', 1995),
            ('The Eternal Sunshine of the Spotless Mind', 2004),
            (                                  'Chicago', 2002)],
           names=['name', 'year'])

In [115]:
txt = pd.Series(['Loreum','ipsom','dolor', 'site', 'amet', 'consecture'], dtype='str') 
txt.str.split('e') #splits elements at 'e'
txt.str.cat() #concat all txt elements

'Loreumipsomdolorsiteametconsecture'